In [1]:
import pandas as pd
import numpy as np

In [2]:
members_13 = pd.read_csv('members_13.csv', parse_dates=['birthday', 'entry_date'])
members_13.head(3)

,member_name,birthday,sex,profession,salary_usd$,entry_date,group_id,city_name,state_name,age,fun_club_name,category_id,monthly_fee_USD$,category_name,membership_duration_days,"sum_fee_paid, USD$"
0,Vanessa Casey,1960-08-08,F,"Engineer, manufacturing systems",1884,2018-05-24,19927387,Montgomery,West Virginia,63,Events That Make You Smarter,6,7,Education & Learning,1830,427.0
1,Cheryl Carey,1958-12-11,N,Trade union research officer,1518,2019-11-14,19712846,Colonia,New Jersey,65,Mix Professionals Chicago,9,18,Fitness,1291,775.0
2,Kendra Valdez,1962-06-16,M,Press photographer,1669,2018-08-06,10528562,Pinckney,Michigan,61,Madison Square Park Mommies!,25,19,Parents & Family,1756,1112.0

In [3]:
# переименуем "проблемные колонки"
members_13 = members_13.rename(columns={'sex':'member_gender', 'age':'member_age','birthday':'member_birthday','salary_usd$':'member_salary', 'monthly_fee_USD$':'monthly_fee', 'sum_fee_paid, USD$':'sum_fee_paid'})

In [4]:
founders_1=pd.read_csv('founders_1.csv', parse_dates=['birthday', 'foundation_date'])
founders_1.head(3)

,name,birthday,sex,email,address,company,profession,salary_usd$,foundation_date,city_id,city_name,state_id,state_code,state_name,funs_club,age
0,Daniel Carter,1965-01-12,M,law@gmail.com,0172 Howard Hill Suite 460\nNorth Peterborough...,"Campbell, Wang and Russell",Furniture designer,4889,2017-12-26,121610,Medway,1433,MA,Massachusetts,Alternative Health NYC,58
1,Samuel Ramirez,1995-12-06,N,pay@gmail.com,"41969 Seth Centers Apt. 977\nBakerville, OK 04560","Ross, Wallace and Williams",Best boy,4109,2018-07-08,125110,Richwood,1417,NJ,New Jersey,Energy Healers NYC,28
2,Frederick Keller,1960-05-10,F,factor@gmail.com,Unit 4661 Box 5647\nDPO AP 93978,"Ward, Adams and Gonzalez","Editor, film/video",4461,2019-08-05,124330,Plainview,1452,NY,New York,Flourishing Life Meetup,63

In [5]:
founders_1 = founders_1.rename(columns={'sex':'founder_gender','name':'founder_name', 'age':'founder_age','birthday':'founder_birthday','salary_usd$':'founder_salary'})

# Задача: вычислить какую сумму членских взносов собирает каждый владелец клуба ежемесячно

In [6]:
# некоторые основатели ведут несколько клубов одновременно
founders_1[['funs_club', 'founder_name']].nunique()

funs_club       8034
founder_name    7605
dtype: int64

In [7]:
# выведем фрейм со списком мульти-владельцев
df=founders_1.groupby('founder_name')['funs_club'].count().to_frame()
multi_founders=df[df['funs_club'] > 1].reset_index()
multi_founders.sort_values(by='funs_club', ascending=False)

       founder_name  funs_club
146  Jennifer Smith          8
122     James Smith          6
357   William Smith          5
124  James Williams          5
351   William Brown          5
..              ...        ...
125    James Wilson          2
123  James Townsend          2
121   James Simpson          2
120      James Ruiz          2
360   Zachary Lewis          2

[361 rows x 2 columns]

In [8]:
founders_1.head(1)

,founder_name,founder_birthday,founder_gender,email,address,company,profession,founder_salary,foundation_date,city_id,city_name,state_id,state_code,state_name,funs_club,founder_age
0,Daniel Carter,1965-01-12,M,law@gmail.com,0172 Howard Hill Suite 460\nNorth Peterborough...,"Campbell, Wang and Russell",Furniture designer,4889,2017-12-26,121610,Medway,1433,MA,Massachusetts,Alternative Health NYC,58

In [9]:
members_13.head(1)

,member_name,member_birthday,member_gender,profession,member_salary,entry_date,group_id,city_name,state_name,member_age,fun_club_name,category_id,monthly_fee,category_name,membership_duration_days,sum_fee_paid
0,Vanessa Casey,1960-08-08,F,"Engineer, manufacturing systems",1884,2018-05-24,19927387,Montgomery,West Virginia,63,Events That Make You Smarter,6,7,Education & Learning,1830,427.0

In [21]:
# значения зарплат основателей надодятся в таблице founder, а значения ежемесячных ставок членских взносов в таблице members
# поэтому объединим таблицы
founders_2=founders_1[['founder_name','funs_club', 'founder_salary', 'foundation_date']].\
           merge(members_13[['member_name', 'fun_club_name', 'entry_date', 'monthly_fee', 'membership_duration_days', 'sum_fee_paid']],
           how='left', left_on='funs_club', right_on='fun_club_name')
founders_2.tail()

,founder_name,funs_club,founder_salary,foundation_date,member_name,fun_club_name,entry_date,monthly_fee,membership_duration_days,sum_fee_paid
130969,Christopher Lewis,Corporate Goes Conscious,3351,2020-03-14,Maria Sheppard,Corporate Goes Conscious,2020-02-26,20,1187,791.0
130970,Christopher Lewis,Corporate Goes Conscious,3351,2020-03-14,Judith Leon,Corporate Goes Conscious,2019-02-09,20,1569,1046.0
130971,Christopher Lewis,Corporate Goes Conscious,3351,2020-03-14,Ricardo Gaines,Corporate Goes Conscious,2017-07-26,20,2132,1421.0
130972,Christopher Lewis,Corporate Goes Conscious,3351,2020-03-14,Brittany Griffith,Corporate Goes Conscious,2017-09-15,20,2081,1387.0
130973,Christopher Lewis,Corporate Goes Conscious,3351,2020-03-14,Caroline Kerr,Corporate Goes Conscious,2018-05-01,20,1853,1235.0

In [22]:
import datetime as dt
from datetime import date

In [23]:
# создадим колонку со значением кол-ва дней существования клуба клубе от даты основания по сегодня
# только сразу преобразуем тип рассчетных данных из timedelta в integer 
for column in ['foundation_date']:
    founders_2['club_lifetime']=(pd.to_datetime(date.today()) - founders_2['foundation_date']).dt.days.astype('int16')

In [24]:
founders_2.sample(10)

,founder_name,funs_club,founder_salary,foundation_date,member_name,fun_club_name,entry_date,monthly_fee,membership_duration_days,sum_fee_paid,club_lifetime
92671,Michael Francis,San Francisco Flute Choir meetup,3467,2018-09-15,Kristina Cain,San Francisco Flute Choir meetup,2019-05-22,9,1467,440.0,1718
4411,Christina Sanchez,Chicagoland Medical Cannabis Career Meetup,1917,2017-11-10,Katrina Costa,Chicagoland Medical Cannabis Career Meetup,2019-10-27,1,1309,44.0,2027
36665,Matthew Cortez,Emerald Astrology&Tarot Group,1677,2017-12-22,David Ball PhD,Emerald Astrology&Tarot Group,2018-05-22,4,1832,244.0,1985
64783,Mitchell Foster,Chicago Mah Jongg Meetup,3770,2018-12-24,Adam Bennett,Chicago Mah Jongg Meetup,2018-01-26,7,1948,455.0,1618
95050,Julian Jones,The Chicago Philosophy Meetup,4149,2019-05-17,Alison Rivas,The Chicago Philosophy Meetup,2019-02-01,16,1577,841.0,1474
73325,Justin Cooke,New York - Battery Park City - Pickup soccer ...,4819,2018-09-07,Douglas Mccarthy,New York - Battery Park City - Pickup soccer ...,2020-02-07,21,1206,844.0,1726
39124,Dennis Hampton,An Evening of Messages From Spirit With Medium...,3178,2017-08-15,Jesse Quinn,An Evening of Messages From Spirit With Medium...,2019-09-12,16,1354,722.0,2114
66625,Tyler Harvey,The Upper West Side Book Club,3811,2017-06-02,Joel Copeland,The Upper West Side Book Club,2018-09-17,7,1714,400.0,2188
118379,James Daniels,Action and Reaction: Devised Theatre,3284,2018-10-27,Mrs. Melissa Buck MD,Action and Reaction: Devised Theatre,2018-06-04,14,1819,849.0,1676
88492,Samantha Miller,The NY Culture Circle!,2465,2017-12-27,Donald Heath,The NY Culture Circle!,2018-01-02,23,1972,1512.0,1980

In [25]:
# суммы взносов собранные владельцами ежемесячно (сортировка по убыванию)
founders_2.groupby('founder_name')['monthly_fee'].sum().reset_index().sort_values('monthly_fee', ascending=False)

         founder_name  monthly_fee
3259   Jennifer Smith         1886
7497    William Brown         1356
3179   Jennifer Brown         1331
2944      James Smith         1170
6239     Robert Smith         1107
...               ...          ...
1304    Charles Sloan            0
1319     Chelsea King            0
3780   Joshua Chapman            0
1334    Cheryl Keller            0
6078  Regina Gonzales            0

[7605 rows x 2 columns]

In [11]:
# соотношение суммарной зарплаты и суммы от поступления взносов (сортировка по убыванию суммы взносов)
founders_2.groupby('founder_name', as_index=False).agg({'sum_fee_paid':'sum', 'founder_salary':'sum'})\
                    .sort_values(by='sum_fee_paid', ascending=False)

           founder_name  sum_fee_paid  founder_salary
3259     Jennifer Smith      105608.0          473598
7497      William Brown       73217.0          265476
3179     Jennifer Brown       69786.0          213984
6239       Robert Smith       62650.0          196923
2944        James Smith       61413.0          265688
...                 ...           ...             ...
4855        Maria Grant           0.0           52948
7031  Teresa Fitzgerald           0.0           41648
1180        Carol Hayes           0.0           33456
1189      Carol Watkins           0.0           31738
6695        Sheila Horn           0.0           53042

[7605 rows x 3 columns]

In [12]:
# посчитаем, какой процент от месячной зарплаты основателей составляют собираемые клубные взносы
founders_month_toll=founders_2.groupby('founder_name', as_index=False)['monthly_fee'].sum()
founders_month_toll

         founder_name  monthly_fee
0          Aaron Barr           70
1         Aaron Black          228
2         Aaron Burke          459
3         Aaron Craig           20
4        Aaron Curtis          300
...               ...          ...
7600  Zachary Shelton           13
7601    Zachary Simon          345
7602    Zachary Terry          209
7603    Zachary Yoder          400
7604     Zoe Ferguson          112

[7605 rows x 2 columns]

In [13]:
perc_fee_monthly=founders_2[['founder_name', 'founder_salary']].drop_duplicates().merge(founders_month_toll, on='founder_name')
perc_fee_monthly

          founder_name  founder_salary  monthly_fee
0        Daniel Carter            4889          361
1        Daniel Carter            1770          361
2       Samuel Ramirez            4109          133
3     Frederick Keller            4461          160
4        Lauren Garcia            3194          208
...                ...             ...          ...
8029      James Snyder            2848           91
8030        Wayne Ross            2242          240
8031     John Alvarado            2617          273
8032  Russell Calderon            4558          437
8033      Angela Davis            3183          276

[8034 rows x 3 columns]

In [14]:
# выведем топ-10 владельцев клубов по проценту ежемесячных поступлений членских взносов
perc_fee_monthly['perc_fee_monthly']=(perc_fee_monthly['monthly_fee']/perc_fee_monthly['founder_salary']*100).round(1)
perc_fee_monthly.nlargest(10, 'perc_fee_monthly')

          founder_name  founder_salary  monthly_fee  perc_fee_monthly
2300    Jennifer Smith            2120         1886              89.0
4196    Jennifer Brown            1572         1331              84.7
2306    Jennifer Smith            2315         1886              81.5
836      William Brown            2001         1356              67.8
834      William Brown            2144         1356              63.2
4197    Jennifer Brown            2133         1331              62.4
6607  Alexander Moreno            1600          988              61.8
2303    Jennifer Smith            3074         1886              61.4
468        James Smith            2013         1170              58.1
2301    Jennifer Smith            3395         1886              55.6

В будущих рекламных компаниях можно более активно сотрудничать именно с этими владельцами клубов, поскольку им удается собирать суммы членских взносов, сопоставимые с их собственными зарплатами, а значит они более заинтересованы уделять больше времени работе с членами, рассчитывая на получение рекламных бюджетов от рекламодателей.